{
  "en": {
    "TK1": "Daniel Kahneman's book Thinking, fast and slow\", has made an huge impression to me. \n\t\tThe main idea is, that humans are mostly running in automatic mode, and their control \n\t\tsystem is mostly instinctive. Kahneman calls this system the \"System 1\" It can be imagined \n\t\tlike a small robot inside your head, which programmed for only the most common tasks.\n\t\tSuch as tying your shoestrings, brushing your teeth, etc. But \n\t\tinside of the human wonderful machinery also exists another \"robot\", which Kahneman calls \n\t\t\"System 2\" which has a more complicated program, based on analysis and a logical reaction\n\t\t set based on the analysis. His most striking example is, that if you are asked, \n\t\t what is 2 x 2 , you don't have to think about it. But when you are asked, what is \n\t\t 24 x 17, you don't have any answer. You would have to take a paper and make the calculation on the paper.",
    "TK2": "Somehow I stumbled over this example. There is another Book , \"Trachtenberg  speed system \n\t\t of basic mathematics\", which just explains, how to do calculations of 24 x 17 in your head, \n\t\t without having to use paper and pencil.",
    "TK3": "Write it down with bracked connecting the 2 outer numbers and the 2 inner numbers.",
    "TK4": "Multiply the 2 outer numbers 2 x 7=14 and then the inner 2 numbers 4 x 1 = 4  and add those 2 numbers, 14+4 =18\n\t\tThe end result will be put into a scheme of 4 placeholders. The 18 is put into the middle two placeholders.",
    "TK5": "Then multiply the tens of each number 2 x  1 = 2 and put it into the left two placeholders.",
    "TK6": "Afterwards multiply the last digits of each number 4 x 7 =28  and put it into the right two  placeholders.",
    "TK7": "Now, you have to add up the three multiplication results",
    "TK8": "We are adding the 2 + 8 = 10, that gives us 1 which carried on to the hundreds, and we write 0 to the place.",
    "TK9": "So, the end result is  24 x 17 = 408.",
    "TK10": "For me it is still hard to do these calculations in your head, but when writing down the numbers on paper, \n\t\tit is quicker then the system I learned at school. I have tried to do the calculations in my head, but I \n\t\tstill find it quite prone to mistakes, although from time to time I do some rehearsals. Most of all, I \n\t\ttend to forget the carry.  During my work, nevertheless, I still prefer my HP calculator and Excel, it's \n\t\tjust takes too much of memory space in my head. I just have to economize my \"System 2\" for all the drawing \n\t\twork, which have to be done simultaneously to the calculations.",
    "TK11": "I was dumbfounded by the path of life of both Trachtenberg and Kahneman, both were Jewish persecuted by \n\t\tthe Nazis, having everything else then a easy life, and despite all these obstacles they came across all \n\t\tthese wonderful insights.",
    "TK12": "I am strongly reminded of the \"cascade control\", used for instance at electronically controlled CNC machineries. In those\n\t\tcontrols  there is an outer (feedback-) loop and an inner (feedback) loop and they are nested.\n\t\tThe exterior loop must be slower then the interior loop for a correct functioning of the control.\n\t\tSo I think instinctively, that humans are Cascade controled, the outer control is system 2 and the inner is system 1.",
    "TK13": "I made a little cheat sheet to remember the rules for mutiplication with numbers 2-12",
    "TK14": "Shepherds in Egypt, who are illiterate and ill-advised, are worthwhile watching when they are trading sheep. This is due to their, to put it mildly, incredible method of multiplication. I heard about it in my time in Damascus, but I did not understand it, and frankly I still don't. Here's what happens in a trade: buyer and seller sit down on the sand opposite each other and draw a cross on the ground with a stick. After going through the haggling ceremony of Arab culture, they finally come to an agreement on the price. Let's say 14 lambs for 60 dinars each. A number of small stones equal to the number of sheep are placed side by side above the cross, and the agreed number of dinars on the other side. Now they start by doubling the number of stones on one side and halving on the other (it doesn't matter of which side you start to reduce and increase, by the way.) If you have to halve the number 7, for example, you get three and a half, of course, but you simply don't count the halves (you can't halve the stones). When the decreasing side inevitably ends up with the number one, the most incredible manoeuvre follows: on the side to be reduced,  all the piles of stones with an even number of symbols are sorted out. Since an even number is \"unholy\", these stones are simply removed, including the opposite side. Then just add up the stones on the doubled side. Quite magically, the result is always correct. Even my maths teacher could not solve the method, but said there was of course a natural explanation. I have tried the method with every possible number and it always works. I have demonstrated the strange calculation method with a few examples. Let anyone who can do it find out.",
    "TK15": "Another way to multiply, so called Russian peasant method",
    "TK16": "click the right and left arrows to see how the calculation is progressing from start to end",
    "TK17": "I found this way on the following website",
    "TK18": "Trachtenberg way of multiplikation",
    "TK19": "The following paragraph is taken from the book :",
    "TK20": "The end result is:",
    "TK21": "Put in your own numbers and press the button to see how the calculation is done.",
    "TK22": "Multiply the 2 inner numbers and then the outer 2 numbers and add those 2 numbers. The end result will be put into the middle two placeholders.",
    "TK23": "Then multiply the tens of each number and put it into the left two placeholders.",
    "TK24": "Afterwards multiply the last digits of each number and put it into the right two  placeholders.",
    "TK25": "Now, add these three multiplication results"
  },
  "fi": {
    "TK1": "Daniel Kahnemanin kirja \"Ajattelu, nopeasti ja hitaasti\", on tehnyt minulle valtavan vaikutuksen.\n\t\tPääideana on, että ihmiset elelevät enimmäkseen automaattitilassa ja heidän ohjausjärjestelmä perustuu\n\t\tenimmäkseen vaistoihin. Kahneman kutsuu tätä järjestelmää \"Systemi 1\". Se voidaan kuvitella\n\t\tkuten pieni robotti pään sisällä, joka on ohjelmoitu vain kaikesta yleisimpiin tehtäviin.\n\t\tKuten kengännauhojen sitominen, hampaiden harjaus jne. Mutta\n\t\tihmisen ihmeellisen koneiston sisällä on myös toinen \"robotti\", jota Kahneman kutsuu\n\t\t\"Systemi 2\", jolla on monimutkaisempi ohjelma, joka perustuu analyysiin ja loogiseen reaktioon\n\t\t  analyysin perusteella. Hänen silmiinpistävin esimerkki on, että jos sinulta kysytään,\n\t\t  mikä on 2 x 2, sinun ei tarvitse miettiä sitä sen enempää. Mutta kun sinulta kysytään, mikä on\n\t\t  24 x 17, sinulla ei ole vastausta. Sinun olisi otettava paperi ja tehtävä laskelma paperille.",
    "TK2": "Jotenkin tämä esimerkki aiheutti minulle  päävaivaa . On nimittäin toinenkin kirja, \"Trachtenbergin nopean kertolaskeman perusteet \", joka selittää vain kuinka tehdä 24 x 17 tapaiset laskelmat,\n\t\t  ilman paperi ja lyijykynä, ihan vaan päässä.",
    "TK3": "Kirjoita numerot ylös ja yhdistää ne kaks ulkoiset numerot ja 2 sisäiset numerot sulkumerkeillä.",
    "TK4": "Kerro 2 ulompaa numeroa 2 x 7 = 14 ja sitten sisäiset 2 numeroa 4 x 1 = 4 ja ynnää nämä 2 numeroa, 14 + 4 = 18\n\t\tLopputulos asetetaan 4 paikkamerkkijärjestelmään, niin että 18 sijoitetaan kahden sisimmäisen paikkamerkin päällä.",
    "TK5": "Kerro sitten jokaisesta luvusta kymmenes 2 x 1 = 2 ja laita se vasempaan kahteen paikkaan.",
    "TK6": "Sitten kerro kunkin numeron viimeiset numerot 4 x 7 = 28 ja laita se oikeisiin kahteen paikkaan.",
    "TK7": "Nyt sinun täytyy ynnätä näitten kolme kertolaskelman tulokset",
    "TK8": "Meidän täytyy ynnää 2 + 8 = 10, kirjoitetaan 0 ja siirretään 1 seuraavaan saraan.",
    "TK9": "Joten lopputulos on 24 x 17 = 408.",
    "TK10": "Minulle on edelleen vaikea tehdä näitä laskelmia päässäsi, mutta kirjoittaessani numeroita paperille,\n\t\tse on nopeampi kuin järjestelmä, jonka oppin koulussa. Olen yrittänyt tehdä laskelmat päässäni, mutta minä\n\t\tpitää sitä edelleen melko alttiina virheille, vaikka ajoittain harjoitankin. Ennen kaikkea minä\n\t\tunohtaa kantaa. Työn aikana pidän silti parempana HP-laskinta ja Exceliä, se on\n\t\tvie vain paljon päätäni muistitilaa. Minun täytyy vain säästää \"Järjestelmäni 2\" kaikille piirustuksille\n\t\ttyö, joka on tehtävä samanaikaisesti laskelmien kanssa.",
    "TK11": "Minua hämmentää sekä Trachtenbergin että Kahnemanin elämänpolku, molemmat juutalaiset jotka kärsivät \n\t\tnatsien vainoista, heillä oli kaikki muu sitten helppo elämä, ja kaikista näistä esteistä huolimatta he oivalsivat \n\t\tsitä.",
    "TK12": "Minulle tulee mieleen ohjaustekniikassa käytetty \"Kaskadiohjaus\" joka käytetään esimerkiksi CNC koneiden ohjaukseen.\n\t\tNäissä ohjausjärjestelmissä on  kytketty useampia ohjauspiiriä sarjaan ja sisäkkäin. Sisäinen ohjauselementti on \n\t\tnopeampi kuin ulommainen ohjauselementti. Tämä tarkoittaa, että sisäisen ohjauselementin aikavakion on oltava pienempiä, \n\t\tjotta kaskadiohjaus toimii. Niin että ajattelin, että ihminen on kaskadiohjattu järjestelmä, jossa uloin ohjainjärjestelmä on\n\t\tSysteemi  2 ja sisäinen ohjain on systemi 1.",
    "TK13": "Kirjoitin pienen muistilapun numeroiden 2-12 kertalaskun säännöistä",
    "TK14": "Egyptiläisten luku-, kirjoitus- ja laskutaidottomien paimenten lammaskaupanteko on näkemisen arvoista puuhaa. Tämä johtuu heidän lievästi sanoen uskomattomasta kertolaskumenetelmästään. Kuulin siitä aikoinani Damasissa, mutta en käsittänyt sitä, enkä rehellisesti sanoen käsitä sitä vieläkään. Kaupankäynti käy seuraavasti: Ostaja ja myyjä istuvat hiekalle vastakkain ja piirtävät maahan kepillä ristin. Käytyään arabialaiseen kulttuuriin kuuluvan tinkimisseremonian läpi, he lopulta pääsevät sopimukseen hinnasta. Sanotaanpa vaikka 14 lammasta 60 dinaaria kappale. Ristin yläpuolelle asetetaan vierekkäin lampaita vastaava määrä pieniä kiviä ja toiselle puolelle sovittu dinaarimäärä. Nyt aletaan toiselta puolelta kaksinkertaistamaan kivien määrää, ja toiselta puolelta puolitetaan. (On muuten yksi lysti kummalta puolelta lähtee vähentämään ja nostamaan.) Jos esimerkiksi luku 7 joudutaan puolittamaan saadaan tietysti kolme ja puoli, mutta puolikkaita ei yksinkertaisesti lasketa (eihän kiviä voi puolittaa).Kun vähenevältä puolelta lopulta vääjäämättä päädytään lukuun yksi, seuraa uskomattomin manööveri: vähennettävältä puolelta etsitään kaikki kivikasat, joissa symboleja on parillinen määrä. Koska parillinen luku on \"epäpyhä\", nämä kivet yksinkertaisesti poistetaan mukaanlukien vastakkainen puoli. Sitten vain lasketaan yhteen tuplattujen puolella olevat kivet. Suorastaan taianomaisesti päädytään aina oikeaan lopputulokseen. Edes matematiikan opettajani ei pystynyt ratkaisemaan menetelmää, mutta totesi siihen liittyvän toki jokin luonnollinen selitys. Olen kokeillut menetelmää kaikilla mahdollisilla luvuilla ja aina se toimii. Olen demonstroinut kummallista laskutapaa muutamalla esimerkillä. Ottakoon selvää kuka osaa.",
    "TK15": "Toinen kertolaskun tapa niin sanottu venäläisen maanviljelijän kertolasku",
    "TK16": "klikkaa oikeaa ja vasempaa nuolia niin näet, miten laskenta etenee alusta loppuun.",
    "TK17": "tämän tavan löysin seuraavalta nettisivulta",
    "TK18": "Trachtenbergin kertolasku",
    "TK19": "Seuraava pykälä on otettu kirjasta :",
    "TK20": "Lopputulos on",
    "TK21": "Laita omat numerot ja katso miten tämä menetelmä toimii",
    "TK22": "Kerro 2 sisäiset numerot ja sitten ulkoiset 2 numerot ja ynnää nämä 2 tulokset.\n\t\tLopputulos asetetaan 4 paikkamerkkijärjestelmään, niin että sijoitetaan kahden sisimmäisen paikkamerkin päällä.",
    "TK23": "Kerro sitten jokaisesta luvusta kymmenekset ja laita se vasempaan kahteen paikkaan.",
    "TK24": "Sitten kerro kunkin numeron viimeiset numerot ja laita se oikeisiin kahteen paikkaan.",
    "TK25": "Nyt enää vaan ynnättävää ylläolevien kolmen kertolaskelmien tulokset"
  },
  "fr": {
    "TK1": "Le livre de Daniel Kahneman \"Système 1 / Système 2 : Les deux vitesses de la pensée\", m'a fait une énorme impression.\n\t\tL'idée principale est que les humains fonctionnent principalement en mode automatique et leur \n\t\tsystème de contrôle est principalement instinctif. Kahneman appelle ce système le \"Système 1\" On peut l'imaginer\n\t\tcomme un petit robot à l'intérieur de votre tête, qui ne programme que pour les tâches les plus courantes.\n\t\tComme attacher vos cordons, vous brosser les dents, etc. Mais\n\t\tà l'intérieur de la merveilleuse machine humaine existe également un autre \"robot\", que Kahneman appelle\n\t\t\"Systeme 2\" qui a un programme plus compliqué, basé sur l'analyse et une réaction logique\n\t\t  ensemble basé sur l'analyse. Son exemple le plus frappant est que si on vous le demande,\n\t\t  ce qui est 2 x 2, vous n'avez pas à y penser. Mais quand on vous demande, qu'est-ce\n\t\t  24 x 17, vous n'avez pas de réponse. Il faudrait prendre un papier et faire le calcul sur le papier.",
    "TK2": "D'une certaine manière, je J'étais très inspiré pour cet exemple, parce que Il y a un autre livre, \" Trachtenberg\n\t\t  système de multiplication de vitesse\", qui explique simplement, comment faire des calculs similaire de 24 x 17 dans votre tête,\n\t\t  sans utiliser du papier et crayon.",
    "TK3": "Notez-le avec des crochets reliant les 2 numéros extérieurs et les 2 numéros intérieurs.",
    "TK4": "Multipliez les 2 nombres externes 2 x 7 = 14 puis les 2 nombres internes 4 x 1 = 4 et ajoutez ces 2 \n\t\tnombres, 14 + 4 = 18\n\t\tLe résultat final sera placé dans un schéma de 4 espaces réservés. Le 18 est placé dans \n\t\tles deux espaces réservés du milieu.",
    "TK5": "Multipliez ensuite les dizaines de chaque nombre 2 x 1 = 2 et placez-le dans les deux espaces réservés de gauche.",
    "TK6": "Multipliez ensuite les derniers chiffres de chaque nombre 4 x 7 = 28 et placez-les dans les deux espaces \n\t\tréservés de droite.",
    "TK7": "Maintenant, vous devez ajouter ces trois résultats de multiplication",
    "TK8": "Il faut additionner 2 + 8 = 10, nous ercritons 0 et nous transférons la 1 à la colonne suivante sur le côté gauche.",
    "TK9": "Donc, le résultat final est 24 x 17 = 408.",
    "TK10": "Pour moi, il est encore difficile de faire ces calculs dans votre tête, mais en écrivant les chiffres sur papier,\n\t\tc'est plus rapide que le système que j'ai appris à l'école. J'ai essayé de faire les calculs dans ma tête, mais je\n\t\tle trouve encore assez sujet aux erreurs, bien que de temps en temps je fasse des répétitions. Surtout, je\n\t\tont tendance à oublier le portage. Pendant mon travail, néanmoins, je préfère toujours ma calculatrice HP et Excel, c'est\n\t\tprend juste trop d'espace mémoire dans ma tête. Je dois juste économiser mon \"Système 2\" pour tout le dessin\n\t\ttravail, qui doivent être effectués simultanément aux calculs.",
    "TK11": "J'ai été stupéfait par le chemin de vie de Trachtenberg et de Kahneman, tous deux étaient des Juifs persécutés par\n\t\tles nazis, ayant tout le reste puis une vie facile, et malgré tous ces obstacles, ils sont tombés sur tous\n\t\tces merveilleuses perspectives.",
    "TK12": "Je me rappelle fortement le \"circuit de contrôle en cascade\", utilisé par exemple dans les machines \n\t\tCNC à commande électronique. \n\t\tLes contrôles sont imbriqués, il existe une boucle externe (rétroaction) et une boucle interne (rétroaction).\n\t\tLa boucle extérieure doit être plus lente que la boucle intérieure pour un bon fonctionnement de la contrôle en cascade.\n\t\tCela signifie que la constante de temps de la boucle intérieure doit être plus petite.\n\t\tJe pense donc instinctivement que les humains sont le contrôle en cascade, le contrôle extérieur est le système 2 et \n\t\tl'intérieur est le système 1.",
    "TK13": "J'ai fait une petite feuille de triche pour me souvenir des règles de multiplication avec les nombres 2-12",
    "TK14": "Les bergers égyptiens, analphabètes et mal conseillés, font l'objet d'une attention particulière dans le commerce des ovins. Cela est dû à leur incroyable méthode de multiplication, pour ne pas dire plus. J'en ai entendu parler lorsque j'étais à Damas, mais je ne l'ai pas comprise, et franchement, je ne la comprends toujours pas. Voici ce qui se passe lors d'un échange : l'acheteur et le vendeur s'assoient sur le sable en face l'un de l'autre et tracent une croix sur le sol à l'aide d'un bâton. Après la cérémonie de marchandage propre à la culture arabe, ils finissent par se mettre d'accord sur le prix. Disons 14 agneaux pour 60 dinars chacun. Un nombre de petits cailloux égal au nombre de moutons est placé côte à côte au-dessus de la croix, et le nombre de dinars convenu est placé de l'autre côté. Si l'on doit diviser par deux le chiffre 7, par exemple, on obtient trois et demi, bien sûr, mais on ne compte pas les moitiés (on ne peut pas diviser les pierres par deux). Lorsque le côté qui diminue se retrouve inévitablement avec le chiffre un, la manœuvre la plus incroyable s'ensuit : du côté à réduire, il faut trouver toutes les piles de pierres avec un nombre pair de symboles. Comme un nombre pair est \"impie\", ces pierres sont simplement enlevées, y compris du côté opposé. Il suffit ensuite d'additionner les pierres du côté doublé. Comme par magie, le résultat est toujours correct. Même mon professeur de mathématiques n'a pas pu résoudre la méthode, mais il a dit qu'il y avait bien sûr une explication naturelle. J'ai essayé la méthode avec tous les nombres possibles et elle fonctionne toujours. J'ai démontré cette étrange méthode de calcul à l'aide de quelques exemples. Que celui qui peut le faire le découvre.",
    "TK15": "Une autre méthode de multiplication, dite méthode du paysan russe",
    "TK16": "cliquez sur les flèches droite et gauche pour voir comment le calcul progresse du début à la fin",
    "TK17": "J'ai trouvé ce moyen sur le site suivant",
    "TK18": "Méthode de multiplication de Trachtenberg",
    "TK19": "Le paragraphe suivant est extrait du livre :",
    "TK20": "le résultat final est",
    "TK21": "Entrez vos propres chiffres et appuyez sur le bouton pour voir comment le calcul est effectué.",
    "TK22": "Multipliez les 2 nombres externes  puis les 2 nombres internes  et ajoutez ces 2 \n\t\tnombres.\n\t\tLe résultat final sera placé dans un schéma de 4 espaces réservés. Le resultat est placé dans \n\t\tles deux espaces réservés du milieu.",
    "TK23": "Multipliez ensuite les dizaines de chaque nombre et placez-le dans les deux espaces réservés de gauche.",
    "TK24": "Multipliez ensuite les derniers chiffres de chaque nombre et placez-les dans les deux espaces \n\t\tréservés de droite.",
    "TK25": "Maintenant, vous devez ajouter ces trois résultats de multiplication"
  },
  "ru": {
    "TK1": "Книга даниела канемана \"Мыслить, быстро и медленно \", произвела на меня огромное впечатление. \n\t\tГлавная идея в том, что люди в основном работают в автоматическом режиме, и их управление \n\t\tсистема в основном инстинктивная. канеман называет эту систему \" Система 1 \" Это можно представить. \n\t\tкак маленький робот в твоей голове, который запрограммировал только самые обычные задачи.\n\t\tТакие как завязывание обуви, чистка зубов и т.д. Но \n\t\tвнутри человеческой чудесной техники также существует еще один \"робот\" который канеман называет \n\t\t\"Система 2 \" которая имеет более сложную программу, основанную на анализе и логической реакции\n\t\t установленная на основе анализа. Его самым ярким примером является то, что если вас спросят, \n\t\t что такое 2 x 2, ты не должен думать об этом. Но когда тебя спрашивают, что такое \n\t\t 24 x 17, у тебя нет и 39 нет ответа. Вы должны будете взять бумагу и сделать расчеты на бумаге.",
    "TK2": "Каким-то образом я наткнулся на этот пример. Есть еще одна книга, \" скоростная система Трахтенберга. \n\t\t базовой математики \" что только объясняет, как делать вычисления 24 x 17 в вашей голове, \n\t\t без использования бумаги и карандаша.",
    "TK3": "Запишите его с помощью креплений, соединяющих 2 внешних номера и 2 внутренних номера.",
    "TK4": "Умножьте 2 внешних числа 2 x 7 = 14, а затем внутренние 2 числа 4 x 1 = 4 и сложите эти 2 числа, 14 + 4 = 18.\n\t\tКонечный результат будет заложен в схему из 4-х человек. Из них 18 будут помещены в средние два держателя.",
    "TK5": "Затем умножьте десятки каждого числа 2 x 1 = 2 и поместите их в левые два плейсхолдера.",
    "TK6": "После этого умножьте последние цифры каждого числа 4 x 7 = 28 и поместите их в нужные два плейсхолдера.",
    "TK7": "Теперь, вы должны складывать всё эти три результата умножения.",
    "TK8": "Мы сосчитываем 2 + 8 = 10, что дает нам 1, которая нам нужну перейти к сотен, и мы пишем 0 на месте.",
    "TK9": "Таким образом, конечный результат 24 x 17 = 408.",
    "TK10": "Для меня все еще сложно делать эти вычисления в голове, но при записи чисел на бумаге, \n\t\tэто быстрее, чем система, которую мы выучили в школе. Я пытался делать расчеты в своей голове, но... \n\t\tвсе еще находят его довольно склонным к ошибкам, хотя время от времени я делаю некоторые репетиции. Больше всего я \n\t\tкак правило, забываю переноску.  Тем не менее, во время работы я все еще предпочитаю калькулятор HP и Excel, . \n\t\tпросто занимает слишком много памяти в моем озгее. Я просто должен экономить свое \"систем 2\" для  \n\t\tработы конструирования, которые должны выполняться одновременно с расчетами.",
    "TK11": "Я был ошарашен жизненным путем как Трахтенберга, так и Кахнемана, оба были евреями, преследуемыми \n\t\tнацисты, имея все остальное, тогда легкая жизнь, и, несмотря на все эти препятствия, они столкнулись со всем. \n\t\tэти чудесные прозрения.",
    "TK12": "Я сильно напоминаю \" каскадное управление \" используется, например, на обрабативающих центрах с цифровым программным управлением. В тех\n\t\tуправления есть внешный регулятор с обратной связью и внутренный регулятор с обратной связью, и они вложены друг в друга.\n\t\tBнешная обратная связь должен быть медленнее внутренного регулятора.\n\t\tПоэтому я думаю, что люди управляются Каскадом, внешний обратный связь - это система 2, а внутренний обратный связь- это система 1.",
    "TK13": "Я сделал маленький шпаргалку, чтобы запомнить правила мултипликации с числами 2-12.",
    "TK14": "Пастухи в Египте, неграмотные и плохо соображающие, представляют собой зрелище в торговле овцами. Это объясняется их, мягко говоря, невероятным методом размножения. Я слышал о нем в свое время в Дамаске, но не понимал его, и, честно говоря, до сих пор не понимаю. Вот что происходит при торге: покупатель и продавец садятся на песок напротив друг друга и палочкой рисуют на земле крест. Пройдя через церемонию торга, характерную для арабской культуры, они, наконец, приходят к соглашению о цене. Допустим, 14 ягнят по 60 динаров за каждого. Несколько маленьких камней, равных количеству овец, кладут рядом с крестом, а с другой стороны - оговоренное количество динаров. Теперь начните удваивать количество камней с одной стороны и уменьшать вдвое с другой (кстати, это вопрос того, с какой стороны вы начинаете уменьшать и увеличивать). Если, например, число 7 нужно уменьшить вдвое, то, конечно, получится три с половиной, но вы просто не будете считать половинки (вы не можете уменьшить камни вдвое). Когда уменьшающаяся сторона неизбежно заканчивается числом один, следует самый невероятный маневр: на уменьшающейся стороне найдите все кучки камней с четным числом символов. Поскольку четное число \"нечестиво\", эти камни просто удаляются, включая противоположную сторону. Затем просто сложите камни на удвоенной стороне. Совершенно волшебным образом результат всегда оказывается правильным. Даже мой учитель математики не смог разгадать этот метод, но сказал, что, конечно, существует естественное объяснение. Я пробовал этот метод со всеми возможными числами, и он всегда работает. Я продемонстрировал странный метод вычисления на нескольких примерах. Пусть узнает тот, кто сможет это сделать.",
    "TK15": "Другой способ размножения, так называемый русский крестьянский метод",
    "TK16": "нажмите на стрелки вправо и влево, чтобы увидеть, как выполняется расчет от начала до конца",
    "TK17": "Я нашел этот способ на следующем сайте",
    "TK18": "Способ мультипликации Трахтенберга",
    "TK19": "Следующий абзац взят из книги :",
    "TK20": "конечный результат",
    "TK21": "Введите свои собственные числа и нажмите кнопку, чтобы увидеть, как выполняется расчет.",
    "TK22": "Умножьте 2 внешних числа, а затем внутренние 2 числа и сложите эти 2 числа.\n\t\tКонечный результат будет заложен в схему из 4-х человек. Из них 18 будут помещены в средние два держателя.",
    "TK23": "Затем умножьте десятки каждого числа и поместите их в левые два плейсхолдера.",
    "TK24": "После этого умножьте последние цифры каждого числа и поместите их в нужные два плейсхолдера.",
    "TK25": "Теперь, вы должны складывать всё эти три результата умножения."
  }
}